#How to write csv file -part 3

In [1]:
import pandas as pd

#head()..print top 5 rows by default

In [2]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')
df

      id  class  sleep_hr  math  science  mar  hin  total
0  S0001      7         6    60       90   78   56     67
1  S0002      5         4    90       60   67   78     76
2  S0003      6         6    70       70   56   98     56
3  S0004      9         8    50       80   34   43     89
4  S0005      3         5    50       80   89   53     76
5  S0006      6         5    60       80   76   63     49
6  S0007      2         5    60       89   56   73     78

In [3]:
df.head()

      id  class  sleep_hr  math  science  mar  hin  total
0  S0001      7         6    60       90   78   56     67
1  S0002      5         4    90       60   67   78     76
2  S0003      6         6    70       70   56   98     56
3  S0004      9         8    50       80   34   43     89
4  S0005      3         5    50       80   89   53     76

In [4]:
df.head(2)

      id  class  sleep_hr  math  science  mar  hin  total
0  S0001      7         6    60       90   78   56     67
1  S0002      5         4    90       60   67   78     76

In [5]:
df.head(12)

      id  class  sleep_hr  math  science  mar  hin  total
0  S0001      7         6    60       90   78   56     67
1  S0002      5         4    90       60   67   78     76
2  S0003      6         6    70       70   56   98     56
3  S0004      9         8    50       80   34   43     89
4  S0005      3         5    50       80   89   53     76
5  S0006      6         5    60       80   76   63     49
6  S0007      2         5    60       89   56   73     78

#tail()...print bottom 5 rows by default

In [6]:
df.tail()

      id  class  sleep_hr  math  science  mar  hin  total
2  S0003      6         6    70       70   56   98     56
3  S0004      9         8    50       80   34   43     89
4  S0005      3         5    50       80   89   53     76
5  S0006      6         5    60       80   76   63     49
6  S0007      2         5    60       89   56   73     78

In [7]:
df.tail(1)

      id  class  sleep_hr  math  science  mar  hin  total
6  S0007      2         5    60       89   56   73     78

In [8]:
df.tail(3)

      id  class  sleep_hr  math  science  mar  hin  total
4  S0005      3         5    50       80   89   53     76
5  S0006      6         5    60       80   76   63     49
6  S0007      2         5    60       89   56   73     78

#To change the datatype of any of any column

In [12]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',dtype={'class':'float64','math':'float64'})
df

      id  class  sleep_hr  math  science  mar  hin  total
0  S0001    7.0         6  60.0       90   78   56     67
1  S0002    5.0         4  90.0       60   67   78     76
2  S0003    6.0         6  70.0       70   56   98     56
3  S0004    9.0         8  50.0       80   34   43     89
4  S0005    3.0         5  50.0       80   89   53     76
5  S0006    6.0         5  60.0       80   76   63     49
6  S0007    2.0         5  60.0       89   56   73     78

#To change yes=true and no=false

In [14]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv')
df

      id  class  sleep_hr  math  science  mar  hin  total date
0  S0001      7         6    60       90   78   56     67  yes
1  S0002      5         4    90       60   67   78     76  yes
2  S0003      6         6    70       70   56   98     56   no
3  S0004      9         8    50       80   34   43     89  yes
4  S0005      3         5    50       80   89   53     76  yes
5  S0006      6         5    60       80   76   63     49   no
6  S0007      2         5    60       89   56   73     78   no

In [16]:
df=pd.read_csv('D:\Movies\BOLLYWOOD\Flames\Book2.csv',true_values=['yes'],false_values=['no'])
df

      id  class  sleep_hr  math  science  mar  hin  total   date
0  S0001      7         6    60       90   78   56     67   True
1  S0002      5         4    90       60   67   78     76   True
2  S0003      6         6    70       70   56   98     56  False
3  S0004      9         8    50       80   34   43     89   True
4  S0005      3         5    50       80   89   53     76   True
5  S0006      6         5    60       80   76   63     49  False
6  S0007      2         5    60       89   56   73     78  False